## **Librerías**

In [2]:
import pandas as pd
import numpy as np

## **Código**

#### **Convertir una lista en diccionario**

In [18]:
lista = ['A', 'A', 'B', 'C', 'C', 'C']

In [19]:
# La convertimos en una seria, aplicamos una función para contar los valores distintos y la convertimos en diccionario
pd.Series(lista).value_counts().to_dict()

{'C': 3, 'A': 2, 'B': 1}

#### **Expandir los valores de una lista para que cada elemento se vuelva un registro**

In [27]:
df = pd.DataFrame({
    'Key': ['A', 'B'],
    'Data': [[1, 3, 4], [1, 8]]
})

In [32]:
df.explode(column='Data').reset_index(drop=True)

  Key Data
0   A    1
1   A    3
2   A    4
3   B    1
4   B    8

#### **Remplazar valores faltantes con datos de otras columnas**

In [33]:
df = pd.DataFrame(
    {
        "A": [None, 0, 12, 5, None], 
        "B": [3, 4, 1, None, 11]
    }
)

In [34]:
df

      A     B
0   NaN   3.0
1   0.0   4.0
2  12.0   1.0
3   5.0   NaN
4   NaN  11.0

In [38]:
df['A'] = df['A'].combine_first(df['B'])

In [39]:
df

      A     B
0   3.0   3.0
1   0.0   4.0
2  12.0   1.0
3   5.0   NaN
4  11.0  11.0